# St7SetSolverFreedomCase

Sets the freedom case used for the analysis. Multiple freedom cases may be specified for linear static analysis
using the St7EnableLSALoadCase function.

long St7SetSolverFreedomCase(long uID, long CaseNum)
Input Parameters
uID
Strand7 model file ID.
CaseNum
Freedom case number.